# WorksetKindFilter Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
WorksetKindFilter Properties
WorksetKindFilter Class See Also
---
The WorksetKindFilter type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IncludeStandaloneWorksetsOnly | True if the results of the filter only match stand-alone worksets; worksets that are not stand-alone will be rejected.  (Inherited from WorksetFilter.) |
| Inverted | True if the results of the filter are inverted; worksets that would normally be accepted by this filter will be rejected, and worksets that would normally be rejected will be accepted.  (Inherited from WorksetFilter.) |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity.  (Inherited from WorksetFilter.) |
| WorksetKind | The WorksetKind. |

# See Also
WorksetKindFilter Class
Autodesk.Revit.DB Namespace